/* automatically generated by rust-bindgen 0.65.1 */

pub const __WORDSIZE: u32 = 64;
pub const __DARWIN_ONLY_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const __DARWIN_ONLY_VERS_1050: u32 = 1;
pub const __DARWIN_UNIX03: u32 = 1;
pub const __DARWIN_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_VERS_1050: u32 = 1;
pub const __DARWIN_NON_CANCELABLE: u32 = 0;
pub const __DARWIN_SUF_EXTSN: &[u8; 14usize] = b"$DARWIN_EXTSN\0";
pub const __DARWIN_C_ANSI: u32 = 4096;
pub const __DARWIN_C_FULL: u32 = 900000;
pub const __DARWIN_C_LEVEL: u32 = 900000;
pub const __STDC_WANT_LIB_EXT1__: u32 = 1;
pub const __DARWIN_NO_LONG_LONG: u32 = 0;
pub const _DARWIN_FEATURE_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_VERS_1050: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const _DARWIN_FEATURE_UNIX_CONFORMANCE: u32 = 3;
pub const __has_ptrcheck: u32 = 0;
pub const __PTHREAD_SIZE__: u32 = 8176;
pub const __PTHREAD_ATTR_SIZE__: u32 = 56;
pub const __PTHREAD_MUTEXATTR_SIZE__: u32 = 8;
pub const __PTHREAD_MUTEX_SIZE__: u32 = 56;
pub const __PTHREAD_CONDATTR_SIZE__: u32 = 8;
pub const __PTHREAD_COND_SIZE__: u32 = 40;
pub const __PTHREAD_ONCE_SIZE__: u32 = 8;
pub const __PTHREAD_RWLOCK_SIZE__: u32 = 192;
pub const __PTHREAD_RWLOCKATTR_SIZE__: u32 = 16;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;

pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const UINT64_MAX: i32 = -1;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST64_MIN: i64 = -9223372036854775808;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const INT_LEAST64_MAX: u64 = 9223372036854775807;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const UINT_LEAST64_MAX: i32 = -1;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i32 = -32768;
pub const INT_FAST32_MIN: i32 = -2147483648;
pub const INT_FAST64_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u32 = 32767;
pub const INT_FAST32_MAX: u32 = 2147483647;
pub const INT_FAST64_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: u32 = 65535;
pub const UINT_FAST32_MAX: u32 = 4294967295;
pub const UINT_FAST64_MAX: i32 = -1;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const UINTPTR_MAX: i32 = -1;
pub const SIZE_MAX: i32 = -1;
pub const RSIZE_MAX: i32 = -1;
pub const WINT_MIN: i32 = -2147483648;
pub const WINT_MAX: u32 = 2147483647;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__mbstate8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mbstateL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    const UNINIT: ::std::mem::MaybeUninit<__darwin_pthread_handler_rec> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__darwin_pthread_handler_rec>(),
        24usize,
        concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        ::std::mem::align_of::<__darwin_pthread_handler_rec>(),
        8usize,
        concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__routine) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__arg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_attr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_attr_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_cond_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_condattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_condattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_condattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutex_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutexattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutexattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutexattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_once_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_once_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_once_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlock_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlock_t>(),
        200usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlockattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
        24usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_t>(),
        8192usize,
        concat!("Size of: ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cleanup_stack) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__cleanup_stack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__opaque)
        )
    );
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Tvg_Canvas {
    _unused: [u8; 0],
}
#[doc = " \\brief A structure responsible for managing and drawing graphical elements.\n\n It sets up the target buffer, which can be drawn on the screen. It stores the Tvg_Paint objects (Shape, Scene, Picture)."]
pub type Tvg_Canvas = _Tvg_Canvas;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Tvg_Paint {
    _unused: [u8; 0],
}
#[doc = " \\brief A structure representing a graphical element.\n\n \\warning The TvgPaint objects can not be shared between Canvases."]
pub type Tvg_Paint = _Tvg_Paint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Tvg_Gradient {
    _unused: [u8; 0],
}
#[doc = " \\brief A structure representing a gradient fill of a Tvg_Paint object."]
pub type Tvg_Gradient = _Tvg_Gradient;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Tvg_Saver {
    _unused: [u8; 0],
}
#[doc = " \\brief A structure representing an object that enables to save a Tvg_Paint object into a file."]
pub type Tvg_Saver = _Tvg_Saver;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Tvg_Animation {
    _unused: [u8; 0],
}
#[doc = " \\brief A structure representing an animation controller object. (BETA_API)"]
pub type Tvg_Animation = _Tvg_Animation;
#[doc = "< CPU rasterizer."]
pub const Tvg_Engine_TVG_ENGINE_SW: Tvg_Engine = 2;
#[doc = "< OpenGL rasterizer."]
pub const Tvg_Engine_TVG_ENGINE_GL: Tvg_Engine = 4;
#[doc = " \\brief Enumeration specifying the engine type used for the graphics backend. For multiple backends bitwise operation is allowed.\n\n \\ingroup ThorVGCapi_Initializer"]
pub type Tvg_Engine = ::std::os::raw::c_uint;
#[doc = "< The value returned in case of a correct request execution."]
pub const Tvg_Result_TVG_RESULT_SUCCESS: Tvg_Result = 0;
#[doc = "< The value returned in the event of a problem with the arguments given to the API - e.g. empty paths or null pointers."]
pub const Tvg_Result_TVG_RESULT_INVALID_ARGUMENT: Tvg_Result = 1;
#[doc = "< The value returned in case the request cannot be processed - e.g. asking for properties of an object, which does not exist."]
pub const Tvg_Result_TVG_RESULT_INSUFFICIENT_CONDITION: Tvg_Result = 2;
#[doc = "< The value returned in case of unsuccessful memory allocation."]
pub const Tvg_Result_TVG_RESULT_FAILED_ALLOCATION: Tvg_Result = 3;
#[doc = "< The value returned in the event of bad memory handling - e.g. failing in pointer releasing or casting"]
pub const Tvg_Result_TVG_RESULT_MEMORY_CORRUPTION: Tvg_Result = 4;
#[doc = "< The value returned in case of choosing unsupported options."]
pub const Tvg_Result_TVG_RESULT_NOT_SUPPORTED: Tvg_Result = 5;
#[doc = "< The value returned in all other cases."]
pub const Tvg_Result_TVG_RESULT_UNKNOWN: Tvg_Result = 6;
#[doc = " \\brief Enumeration specifying the result from the APIs."]
pub type Tvg_Result = ::std::os::raw::c_uint;
#[doc = "< No composition is applied."]
pub const Tvg_Composite_Method_TVG_COMPOSITE_METHOD_NONE: Tvg_Composite_Method = 0;
#[doc = "< The intersection of the source and the target is determined and only the resulting pixels from the source are rendered."]
pub const Tvg_Composite_Method_TVG_COMPOSITE_METHOD_CLIP_PATH: Tvg_Composite_Method = 1;
#[doc = "< The pixels of the source and the target are alpha blended. As a result, only the part of the source, which intersects with the target is visible."]
pub const Tvg_Composite_Method_TVG_COMPOSITE_METHOD_ALPHA_MASK: Tvg_Composite_Method = 2;
#[doc = "< The pixels of the source and the complement to the target's pixels are alpha blended. As a result, only the part of the source which is not covered by the target is visible."]
pub const Tvg_Composite_Method_TVG_COMPOSITE_METHOD_INVERSE_ALPHA_MASK: Tvg_Composite_Method = 3;
#[doc = "< The source pixels are converted to grayscale (luma value) and alpha blended with the target. As a result, only the part of the source which intersects with the target is visible. \\since 0.9"]
pub const Tvg_Composite_Method_TVG_COMPOSITE_METHOD_LUMA_MASK: Tvg_Composite_Method = 4;
#[doc = "< The source pixels are converted to grayscale (luma value) and complement to the target's pixels are alpha blended. As a result, only the part of the source which is not covered by the target is visible. \\BETA_API"]
pub const Tvg_Composite_Method_TVG_COMPOSITE_METHOD_INVERSE_LUMA_MASK: Tvg_Composite_Method = 5;
#[doc = " \\brief Enumeration indicating the method used in the composition of two objects - the target and the source.\n\n \\ingroup ThorVGCapi_Paint"]
pub type Tvg_Composite_Method = ::std::os::raw::c_uint;
#[doc = "< Undefined type."]
pub const Tvg_Identifier_TVG_IDENTIFIER_UNDEF: Tvg_Identifier = 0;
#[doc = "< A shape type paint."]
pub const Tvg_Identifier_TVG_IDENTIFIER_SHAPE: Tvg_Identifier = 1;
#[doc = "< A scene type paint."]
pub const Tvg_Identifier_TVG_IDENTIFIER_SCENE: Tvg_Identifier = 2;
#[doc = "< A picture type paint."]
pub const Tvg_Identifier_TVG_IDENTIFIER_PICTURE: Tvg_Identifier = 3;
#[doc = "< A linear gradient type."]
pub const Tvg_Identifier_TVG_IDENTIFIER_LINEAR_GRAD: Tvg_Identifier = 4;
#[doc = "< A radial gradient type."]
pub const Tvg_Identifier_TVG_IDENTIFIER_RADIAL_GRAD: Tvg_Identifier = 5;
#[doc = " \\brief Enumeration indicating the ThorVG class type.\n\n \\ingroup ThorVGCapi_Paint\n\n \\since 0.9"]
pub type Tvg_Identifier = ::std::os::raw::c_uint;
#[doc = "< Ends the current sub-path and connects it with its initial point - corresponds to Z command in the svg path commands."]
pub const Tvg_Path_Command_TVG_PATH_COMMAND_CLOSE: Tvg_Path_Command = 0;
#[doc = "< Sets a new initial point of the sub-path and a new current point - corresponds to M command in the svg path commands."]
pub const Tvg_Path_Command_TVG_PATH_COMMAND_MOVE_TO: Tvg_Path_Command = 1;
#[doc = "< Draws a line from the current point to the given point and sets a new value of the current point - corresponds to L command in the svg path commands."]
pub const Tvg_Path_Command_TVG_PATH_COMMAND_LINE_TO: Tvg_Path_Command = 2;
#[doc = "< Draws a cubic Bezier curve from the current point to the given point using two given control points and sets a new value of the current point - corresponds to C command in the svg path commands."]
pub const Tvg_Path_Command_TVG_PATH_COMMAND_CUBIC_TO: Tvg_Path_Command = 3;
#[doc = " \\brief Enumeration specifying the values of the path commands accepted by TVG.\n\n Not to be confused with the path commands from the svg path element (like M, L, Q, H and many others).\n TVG interprets all of them and translates to the ones from the PathCommand values."]
pub type Tvg_Path_Command = ::std::os::raw::c_uint;
#[doc = "< The stroke is extended in both endpoints of a sub-path by a rectangle, with the width equal to the stroke width and the length equal to the half of the stroke width. For zero length sub-paths the square is rendered with the size of the stroke width."]
pub const Tvg_Stroke_Cap_TVG_STROKE_CAP_SQUARE: Tvg_Stroke_Cap = 0;
#[doc = "< The stroke is extended in both endpoints of a sub-path by a half circle, with a radius equal to the half of a stroke width. For zero length sub-paths a full circle is rendered."]
pub const Tvg_Stroke_Cap_TVG_STROKE_CAP_ROUND: Tvg_Stroke_Cap = 1;
#[doc = "< The stroke ends exactly at each of the two endpoints of a sub-path. For zero length sub-paths no stroke is rendered."]
pub const Tvg_Stroke_Cap_TVG_STROKE_CAP_BUTT: Tvg_Stroke_Cap = 2;
#[doc = " \\brief Enumeration determining the ending type of a stroke in the open sub-paths."]
pub type Tvg_Stroke_Cap = ::std::os::raw::c_uint;
#[doc = "< The outer corner of the joined path segments is bevelled at the join point. The triangular region of the corner is enclosed by a straight line between the outer corners of each stroke."]
pub const Tvg_Stroke_Join_TVG_STROKE_JOIN_BEVEL: Tvg_Stroke_Join = 0;
#[doc = "< The outer corner of the joined path segments is rounded. The circular region is centered at the join point."]
pub const Tvg_Stroke_Join_TVG_STROKE_JOIN_ROUND: Tvg_Stroke_Join = 1;
#[doc = "< The outer corner of the joined path segments is spiked. The spike is created by extension beyond the join point of the outer edges of the stroke until they intersect. In case the extension goes beyond the limit, the join style is converted to the Bevel style."]
pub const Tvg_Stroke_Join_TVG_STROKE_JOIN_MITER: Tvg_Stroke_Join = 2;
#[doc = " \\brief Enumeration specifying how to fill the area outside the gradient bounds."]
pub type Tvg_Stroke_Join = ::std::os::raw::c_uint;
#[doc = "< The remaining area is filled with the closest stop color."]
pub const Tvg_Stroke_Fill_TVG_STROKE_FILL_PAD: Tvg_Stroke_Fill = 0;
#[doc = "< The gradient pattern is reflected outside the gradient area until the expected region is filled."]
pub const Tvg_Stroke_Fill_TVG_STROKE_FILL_REFLECT: Tvg_Stroke_Fill = 1;
#[doc = "< The gradient pattern is repeated continuously beyond the gradient area until the expected region is filled."]
pub const Tvg_Stroke_Fill_TVG_STROKE_FILL_REPEAT: Tvg_Stroke_Fill = 2;
#[doc = " \\brief Enumeration specifying how to fill the area outside the gradient bounds."]
pub type Tvg_Stroke_Fill = ::std::os::raw::c_uint;
#[doc = "< A line from the point to a location outside the shape is drawn. The intersections of the line with the path segment of the shape are counted. Starting from zero, if the path segment of the shape crosses the line clockwise, one is added, otherwise one is subtracted. If the resulting sum is non zero, the point is inside the shape."]
pub const Tvg_Fill_Rule_TVG_FILL_RULE_WINDING: Tvg_Fill_Rule = 0;
#[doc = "< A line from the point to a location outside the shape is drawn and its intersections with the path segments of the shape are counted. If the number of intersections is an odd number, the point is inside the shape."]
pub const Tvg_Fill_Rule_TVG_FILL_RULE_EVEN_ODD: Tvg_Fill_Rule = 1;
#[doc = " \\brief Enumeration specifying the algorithm used to establish which parts of the shape are treated as the inside of the shape."]
pub type Tvg_Fill_Rule = ::std::os::raw::c_uint;
#[doc = " \\brief A data structure storing the information about the color and its relative position inside the gradient bounds."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tvg_Color_Stop {
    #[doc = "< The relative position of the color."]
    pub offset: f32,
    #[doc = "< The red color channel value in the range [0 ~ 255]."]
    pub r: u8,
    #[doc = "< The green color channel value in the range [0 ~ 255]."]
    pub g: u8,
    #[doc = "< The blue color channel value in the range [0 ~ 255]."]
    pub b: u8,
    #[doc = "< The alpha channel value in the range [0 ~ 255], where 0 is completely transparent and 255 is opaque."]
    pub a: u8,
}
#[test]
fn bindgen_test_layout_Tvg_Color_Stop() {
    const UNINIT: ::std::mem::MaybeUninit<Tvg_Color_Stop> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Tvg_Color_Stop>(),
        8usize,
        concat!("Size of: ", stringify!(Tvg_Color_Stop))
    );
    assert_eq!(
        ::std::mem::align_of::<Tvg_Color_Stop>(),
        4usize,
        concat!("Alignment of ", stringify!(Tvg_Color_Stop))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Color_Stop),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Color_Stop),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Color_Stop),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Color_Stop),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Color_Stop),
            "::",
            stringify!(a)
        )
    );
}
#[doc = " \\brief A data structure representing a point in two-dimensional space."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tvg_Point {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_Tvg_Point() {
    const UNINIT: ::std::mem::MaybeUninit<Tvg_Point> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Tvg_Point>(),
        8usize,
        concat!("Size of: ", stringify!(Tvg_Point))
    );
    assert_eq!(
        ::std::mem::align_of::<Tvg_Point>(),
        4usize,
        concat!("Alignment of ", stringify!(Tvg_Point))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Point),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Point),
            "::",
            stringify!(y)
        )
    );
}
#[doc = " \\brief A data structure representing a three-dimensional matrix.\n\n The elements e11, e12, e21 and e22 represent the rotation matrix, including the scaling factor.\n The elements e13 and e23 determine the translation of the object along the x and y-axis, respectively.\n The elements e31 and e32 are set to 0, e33 is set to 1."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tvg_Matrix {
    pub e11: f32,
    pub e12: f32,
    pub e13: f32,
    pub e21: f32,
    pub e22: f32,
    pub e23: f32,
    pub e31: f32,
    pub e32: f32,
    pub e33: f32,
}
#[test]
fn bindgen_test_layout_Tvg_Matrix() {
    const UNINIT: ::std::mem::MaybeUninit<Tvg_Matrix> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Tvg_Matrix>(),
        36usize,
        concat!("Size of: ", stringify!(Tvg_Matrix))
    );
    assert_eq!(
        ::std::mem::align_of::<Tvg_Matrix>(),
        4usize,
        concat!("Alignment of ", stringify!(Tvg_Matrix))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e11) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Matrix),
            "::",
            stringify!(e11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e12) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Matrix),
            "::",
            stringify!(e12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e13) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Matrix),
            "::",
            stringify!(e13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e21) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Matrix),
            "::",
            stringify!(e21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e22) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Matrix),
            "::",
            stringify!(e22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e23) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Matrix),
            "::",
            stringify!(e23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e31) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Matrix),
            "::",
            stringify!(e31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e32) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Matrix),
            "::",
            stringify!(e32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e33) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tvg_Matrix),
            "::",
            stringify!(e33)
        )
    );
}
extern "C" {
